# ConvertingOldAxisToNormal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..ConvertingOldAxisToNormal Property
BuiltInFailures..::..GeneralFailures Class See Also
---
This operation will convert the existing axis of revolution to a normal line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConvertingOldAxisToNormal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConvertingOldAxisToNormal As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConvertingOldAxisToNormal {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace